XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
	<vendor>Sinowealth</vendor>
	<name>SH3xF9xx_DFP</name>
	<description>Sinowealth SH3xF9xx Device Family Pack</description>
	<url>http://www.sinowealth.com/Tools/ARM32/</url>
	
	<releases>

		<release version="2.2.0" date="2022-10-12">
			Added Chip SH30F9020
			Added Chip SH30F9021
			Added Chip SH30F9071
			Added Chip SH30F9820
			Added Chip SH30F9821
			Added Chip SH30F9871
			Added Chip SH32F9B00
			Added Chip SH32F9002
			Added Chip SH32F9062			
		</release>

		<release version="2.1.0" date="2021-11-26">
			Update the system.c/.h file from the templates folder to the Startup folder to match the CMSIS Pack standard.		
		</release>

		<release version="2.0.0" date="2021-11-01">
		  New Architecture
			Added Chip SH32F9001
			Added Chip SH32F9801
			Added Chip SH32F9061
			Added Chip SH32F9861			
		</release>

	</releases>
  
	<keywords>
		<!-- keywords for indexing -->
    <keyword>Sinowealth</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package Sinowealth</keyword>
	</keywords>

  <requirements>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  
	<!-- devices section (mandatory for Device Family Packs) -->
	<devices>
			<family Dfamily="SH3xF9xx Series" Dvendor="Sinowealth:149">
    
      <environment name="uv" >
        <CMisc>--c99</CMisc>
      </environment>    

			<description>
SH3xF9 is a high-performance 32-bit microcontroller based on ARM Cortex core.  It is especially suitable for the development of smart home, major appliances and motor control schemes.
                                           
      - Up to 120MHz
      - Clock Security Monitor (CSM)
      - System timer (SYSTICK)
      - SRAM Detection Module (RAMBIST)
      - External interrupt/event controller (EXTI)
      - Serial peripheral interfaces (SPI)
      - Two-wire serial interfaces (TWI)
      - High performance ADC
      - Timers/counters (TIMER)                            
      - Pulse Width Modulation (PWM)                                      
      - Watchdog Timer (WDT) 
      - Cyclic Redundancy Check (CRC)                       
      - Direct Memory Access (DMA)
      - Programmable Counter Array (PCA)
      - Uiversal asynchronous receiver transmitter (UART)      
			</description>



		<!-- ************************  Subfamily 'SH30F9xx_SA0'  ************************ -->
			<subFamily DsubFamily="SH30F9xx_SA0">
				<compile header="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9xx_sa0.h"  define="SH30F9_SA0"/>
	
        <description>
SH30F9xx_SA0 - ARM Cortex-M0+ Core
  Frequency up to 48 MHz
  32-bit hardware multiply unit
  NVIC support 16 internal, 32 external interrupts, each has 4 priority levels

Memories
  Flash size up to 256KB
  SRAM size up to 16KB
  EEPROM size 4KB

Low power management
  Power saving mode: sleep mode, stop mode

Advanced analog peripherals
  1 x 12bit, up to 1us ADC (up to 28 chs)

Integrated peripherals interface
  Up to 4 x UART
  Up to 2 x SPI
  Up to 4 x PCA
  Up to 4 x PWM
  Up to 1 x TWI

On-chip resources
  3 x 16 bit Timer, 1 x 32 bit Timer, 1 x SysTick Timer, 2 x WDT
  4-chs DMA support: UART, SPI, EXTI, TIMER, PCA, ADC, LED, PWM, TK
  System supervisor and reset: POR, BOD, LVD
  Up to 61 GPIO available, CSM, EXTI, NVIC, 
  32-bit CRC, 96-bit unique ID, RAMBIST
  On-chip clock: HSI (24MHz), LSI (128KHz)
				</description>			
			  
				<!-- *****************************  Device 'SH30F9020'  ***************************** -->
				<device Dname="SH30F9020">

  	  		<processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
					<compile header="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9020.h"  define="_SH30F9020"/>
					<debug svd="SVD/sh30f9020.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x40000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH30F9020.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9020_iar.icf"/>
          </environment> 
          
					<description>
- Cortex-M0+
- Up to 48MHz
- Flash Size:256KB, SRAM:16KB, EEPROM:4KB, OTP:1KB
- 1 x ADC (28CHs), 4 x PWM, CSM,  2 x WDT, NVIC, RAMBIST
- 4 x Timer, 4 x UART, 4 x PCA, 2 x SPI, 1 x TWI
- 4 channel DMA, 1 LED, 1 LCD, 16 x EXTI, 1 x CRC
- Up to 61 GPIOs
					</description>
				</device>



				<!-- *****************************  Device 'SH30F9021'  ***************************** -->
				<device Dname="SH30F9021">

  	  		<processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
					<compile header="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9021.h"  define="_SH30F9021"/>
					<debug svd="SVD/sh30f9021.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x40000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH30F9021.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9021_iar.icf"/>
          </environment> 

					<description>
- Cortex-M0+
- Up to 48MHz
- Flash Size:256KB, SRAM:16KB, EEPROM:4KB, OTP:1KB
- 1 x ADC (28CHs), 4 x PWM, CSM,  2 x WDT, NVIC, RAMBIST
- 4 x Timer, 4 x UART, 4 x PCA, 2 x SPI, 1 x TWI
- 4 channel DMA, 16 x EXTI, 1 x CRC
- Up to 42 GPIOs
					</description>
				</device>



				<!-- *****************************  Device 'SH30F9071'  ***************************** -->
				<device Dname="SH30F9071">

