XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
  	  		<processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
					<compile header="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9071.h"  define="_SH30F9071"/>
					<debug svd="SVD/sh30f9071.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x40000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH30F9071.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9071_iar.icf"/>
          </environment> 

					<description>
- Cortex-M0+
- Up to 48MHz
- Flash Size:256KB, SRAM:16KB, EEPROM:4KB, OTP:1KB
- 1 x ADC (28CHs), 4 x PWM, CSM,  2 x WDT, NVIC, RAMBIST
- 4 x Timer, 4 x UART, 4 x PCA, 2 x SPI, 1 x TWI
- 4 channel DMA, 1 LED, 1 LCD, 16 x EXTI, 1 x CRC
- Up to 61 GPIOs,UP to 32-CHs TK
					</description>
				</device>


				<!-- *****************************  Device 'SH30F9820'  ***************************** -->
				<device Dname="SH30F9820">

  	  		<processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
					<compile header="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9820.h"  define="_SH30F9820"/>
					<debug svd="SVD/sh30f9820.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x20000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH30F9820.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9820_iar.icf"/>
          </environment> 

					<description>
- Cortex-M0+
- Up to 48MHz
- Flash Size:128KB, SRAM:16KB, EEPROM:4KB, OTP:1KB
- 1 x ADC (28CHs), 4 x PWM, CSM,  2 x WDT, NVIC, RAMBIST
- 4 x Timer, 4 x UART, 4 x PCA, 2 x SPI, 1 x TWI
- 4 channel DMA, 1 LED, 1 LCD, 16 x EXTI, 1 x CRC
- Up to 61 GPIOs
					</description>
				</device>



				<!-- *****************************  Device 'SH30F9821'  ***************************** -->
				<device Dname="SH30F9821">

  	  		<processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
					<compile header="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9821.h"  define="_SH30F9821"/>
					<debug svd="SVD/sh30f9821.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x20000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH30F9821.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9821_iar.icf"/>
          </environment> 

					<description>
- Cortex-M0+
- Up to 48MHz
- Flash Size:128KB, SRAM:16KB, EEPROM:4KB, OTP:1KB
- 1 x ADC (28CHs), 4 x PWM, CSM,  2 x WDT, NVIC, RAMBIST
- 4 x Timer, 4 x UART, 4 x PCA, 2 x SPI, 1 x TWI
- 4 channel DMA, 16 x EXTI, 1 x CRC
- Up to 42 GPIOs
					</description>
				</device>



				<!-- *****************************  Device 'SH30F9871'  ***************************** -->
				<device Dname="SH30F9871">

  	  		<processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dmpu="0" Dendian="Little-endian" Dclock="48000000"/>
					<compile header="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9871.h"  define="_SH30F9871"/>
					<debug svd="SVD/sh30f9871.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x20000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH30F9871.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9871_iar.icf"/>
          </environment> 
          
					<description>
- Cortex-M0+
- Up to 48MHz
- Flash Size:128KB, SRAM:16KB, EEPROM:4KB, OTP:1KB
- 1 x ADC (28CHs), 4 x PWM, CSM,  2 x WDT, NVIC, RAMBIST
- 4 x Timer, 4 x UART, 4 x PCA, 2 x SPI, 1 x TWI
- 4 channel DMA, 1 LED, 1 LCD, 16 x EXTI, 1 x CRC
- Up to 61 GPIOs,UP to 32-CHs TK
					</description>
				</device>
			
			</subFamily> 
			
<!-- *************************  End sub Family 'SH30F9xx_SA0'  ***************************** -->




		<!-- ************************  Subfamily 'SH32F9xx_SB0'  ************************ -->
			<subFamily DsubFamily="SH32F9xx_SB0">
				<compile header="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9xx_sb0.h"  define="SH32F9_SB0"/>
	
        <description>
SH32F9xx_SB0 - ARM Cortex-M3 Core
  Frequency up to 72 MHz
  32-bit hardware multiply/divide unit
  NVIC support 16 internal, 41 external interrupts, each has 4 priority levels

Memories
  Flash size up to 256KB
  SRAM size up to 16KB 
  CRAM size up to 16KB 
  EEPROM size 6KB  

Low power management
  Power saving mode: sleep mode, stop mode

Advanced analog peripherals
  1 x 12bit, up to 1us ADC (up to 26 chs)

Integrated peripherals interface
  Up to 6 x UART
  Up to 2 x SPI 
  Up to 2 x TWI 
  Up to 4 x PWM
  Up to 8 x PCA

On-chip resources
  4 x 16 bit Timer, RAMBIST, 2 x WDG, CSM, AMOC, LED, LCD
  8-chs DMA support: UART, SPI, EXTI, TIM, ADC, PCA, PWM, LCD, LED
  System supervisor and reset: POR, BOD, LVR, SYSTICK
  Up to 75 GPIO available, NVIC
  32-bit CRC, 96-bit unique ID
  On-chip clock: HSI (24MHz), LSI (128KHz)
        </description>			
			  
				<!-- *****************************  Device 'SH32F9001'  ***************************** -->
				<device Dname="SH32F9001">

