XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
  	  		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="MPU" Dendian="Little-endian" />
					<compile header="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9001.h"  define="_SH32F9001"/>
					<debug svd="SVD/sh32f9001.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x40000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="1"   default="1"/>
       	 	<memory     id="IRAM2"                      start="0x10000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F9001.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9001_iar.icf"/>
          </environment> 
					<description>
- Cortex-M3
- Up to 72MHz
- Flash Size:256KB, SRAM:16KB, CRAM:16KB, EEPROM:6KB, OTP:1KB
- 1 x ADC (26CHs), 4 x PWM, AMOC, CSM, 2 x WDT, LCD, LED
- 4 x Timer, 6 x UART, 2 x SPI, 2 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA, 8 x PCA, NVIC, RAMBIST, SYSTICK     
- Up to 75 GPIOs
					</description>
				</device>


			  
				<!-- *****************************  Device 'SH32F9002'  ***************************** -->
				<device Dname="SH32F9002">

  	  		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="MPU" Dendian="Little-endian" />
					<compile header="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9002.h"  define="_SH32F9002"/>
					<debug svd="SVD/sh32f9002.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x40000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="1"   default="1"/>
       	 	<memory     id="IRAM2"                      start="0x10000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F9002.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9002_iar.icf"/>
          </environment> 
					<description>
- Cortex-M3
- Up to 72MHz
- Flash Size:256KB, SRAM:16KB, CRAM:16KB, EEPROM:6KB, OTP:1KB
- 1 x ADC (26CHs), 4 x PWM, AMOC, CSM, 2 x WDT, LCD, LED
- 4 x Timer, 6 x UART, 2 x SPI, 2 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA, 8 x PCA, NVIC, RAMBIST, SYSTICK     
- Up to 75 GPIOs
					</description>
				</device>


				<!-- *****************************  Device 'SH32F9801'  ***************************** -->
				<device Dname="SH32F9801">

  	  		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="MPU" Dendian="Little-endian" />
					<compile header="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9801.h"  define="_SH32F9801"/>
					<debug svd="SVD/sh32f9801.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x20000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="1"   default="1"/>
       	 	<memory     id="IRAM2"                      start="0x10000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F9801.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
            <environment name="iar">
         		<file category="linkerfile" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9801_iar.icf"/>
            </environment> 
					<description>
- Cortex-M3
- Up to 72MHz
- Flash Size:128KB, SRAM:16KB, CRAM:16KB, EEPROM:6KB, OTP:1KB
- 1 x ADC (26CHs), 4 x PWM, AMOC, CSM, 2 x WDT, LCD, LED
- 4 x Timer, 6 x UART, 2 x SPI, 2 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA, 8 x PCA, NVIC, RAMBIST, SYSTICK     
- Up to 75 GPIOs
					</description>
				</device>

				<!-- *****************************  Device 'SH32F9061'  ***************************** -->
				<device Dname="SH32F9061">

  	  		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="MPU" Dendian="Little-endian" />
					<compile header="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9061.h"  define="_SH32F9061"/>
					<debug svd="SVD/sh32f9061.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x40000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="1"   default="1"/>
       	 	<memory     id="IRAM2"                      start="0x10000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F9061.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9061_iar.icf"/>
          </environment> 
					<description>
- Cortex-M3
- Up to 72MHz
- Flash Size:256KB, SRAM:16KB, CRAM:16KB, EEPROM:6KB, OTP:1KB
- 1 x ADC (26CHs), 4 x PWM, AMOC, CSM, 2 x WDT, LCD, LED
- 4 x Timer, 6 x UART, 2 x SPI, 2 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA, 8 x PCA, NVIC, RAMBIST, SYSTICK     
- Up to 75 GPIOs, 24 channel Touchkey
					</description>
				</device>

				<!-- *****************************  Device 'SH32F9062'  ***************************** -->
				<device Dname="SH32F9062">

  	  		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="MPU" Dendian="Little-endian" />
					<compile header="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9062.h"  define="_SH32F9062"/>
					<debug svd="SVD/sh32f9062.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x40000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="1"   default="1"/>
       	 	<memory     id="IRAM2"                      start="0x10000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F9062.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9062_iar.icf"/>
          </environment> 
					<description>
- Cortex-M3
- Up to 72MHz
- Flash Size:256KB, SRAM:16KB, CRAM:16KB, EEPROM:6KB, OTP:1KB
- 1 x ADC (26CHs), 4 x PWM, AMOC, CSM, 2 x WDT, LCD, LED
- 4 x Timer, 6 x UART, 2 x SPI, 2 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA, 8 x PCA, NVIC, RAMBIST, SYSTICK     
- Up to 75 GPIOs, 24 channel Touchkey
					</description>
				</device>


				<!-- *****************************  Device 'SH32F9861'  ***************************** -->
				<device Dname="SH32F9861">

