XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
  	  		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="MPU" Dendian="Little-endian" />
					<compile header="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9861.h"  define="_SH32F9861"/>
					<debug svd="SVD/sh32f9861.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x20000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x20000000"  size="0x4000"    init   ="1"   default="1"/>
       	 	<memory     id="IRAM2"                      start="0x10000000"  size="0x4000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F9861.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x4000"  default="1"/>
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9861_iar.icf"/>
          </environment> 
					<description>
- Cortex-M3
- Up to 72MHz
- Flash Size:128KB, SRAM:16KB, CRAM:16KB, EEPROM:6KB, OTP:1KB
- 1 x ADC (26CHs), 4 x PWM, AMOC, CSM, 2 x WDT, LCD, LED
- 4 x Timer, 6 x UART, 2 x SPI, 2 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA, 8 x PCA, NVIC, RAMBIST, SYSTICK     
- Up to 75 GPIOs, 24 channel Touchkey
					</description>
				</device>
			
			</subFamily> 
			
<!-- *************************  End sub Family 'SH32F9xx_SB0'  ***************************** -->



           
		<!-- ************************  Subfamily 'SH32F9xx_SC0'  ************************ -->
			<subFamily DsubFamily="SH32F9xx_SC0">
				<compile header="Device/SH32F9xx/SH32F9xx_SC0/Include/sh32f9xx_sc0.h"  define="SH32F9_SC0"/>
	
        <description>
SH32F9xx_SC0 - ARM Cortex-M3 Core
  Frequency up to 120 MHz
  32-bit hardware multiply/divide unit
  NVIC support 16 internal, 42 external interrupts, each has 4 priority levels

Memories
  Flash size up to 512KB
  SRAM size up to 32KB 
  CRAM size up to 32KB 
  EEPROM size 8KB  

Low power management
  Power saving mode: sleep mode, stop mode

Advanced analog peripherals
  1 x 12bit, up to 0.5us ADC (up to 20 chs)

Integrated peripherals interface
  Up to 6 x UART
  Up to 2 x SPI 
  Up to 2 x TWI 
  Up to 4 x GPT

On-chip resources
  4 x 16 bit Timer, 1 x SysTick Timer,  2 x WDG
  24-chs Touchkey, CSM, EXTI, NVIC, RAMBIST
  8-chs DMA support: UART, SPI, TK, EXTI, TIMER, ADC, GPT
  System supervisor and reset: POR, LVR
  Up to 73 GPIO available
  32-bit CRC, 96-bit unique ID
  On-chip clock: HSI (24MHz), LSI (32KHz)
		</description>			
			  
				<!-- *****************************  Device 'SH32F9B00'  ***************************** -->
				<device Dname="SH32F9B00">

  	  		<processor Dcore="Cortex-M3" DcoreVersion="r2p1" Dmpu="MPU" Dendian="Little-endian" />
					<compile header="Device/SH32F9xx/SH32F9xx_SC0/Include/sh32f9b00.h"  define="_SH32F9B00"/>
					<debug svd="SVD/sh32f9b00.svd" default="1"/>
        	<memory     id="IROM1"                      start="0x00000000"  size="0x80000"   startup="1"   default="1"/>
       	 	<memory     id="IRAM1"                      start="0x10000000"  size="0x8000"    init   ="0"   default="1"/>
       	 	<memory     id="IRAM2"                      start="0x20000000"  size="0x8000"    init   ="0"   default="1"/>
       		<algorithm  name="Flash/SH32F9B00.FLM"      start="0x00000000"  size="0x10000000"    RAMstart="0x20000000"  RAMsize="0x8000"  default="1"/>
          <environment name="iar">
         		<file category="linkerfile" name="Device/SH32F9xx/SH32F9xx_SC0/Source/IAR/sh32f9b00_iar.icf"/>
          </environment> 
					<description>
- Cortex-M3
- Up to 120MHz
- Flash Size:512KB, SRAM:32KB, CRAM:32KB, EEPROM:8KB, OTP:1KB
- 2 x ADC(20CHs), 4 x GPT, CSM, 2 x WDT, RAMBIST, 24-chs Touchkey
- 4 x Timer, 6 x UART, 2 x SPI, 2 x TWI, 16 x EXTI, 1 x CRC
- 8 channel DMA, SYSTICK     
- Up to 73 GPIOs
					</description>
				</device>
			
			</subFamily> 
			
<!-- *************************  End sub Family 'SH32F9xx_SC0'  ***************************** -->

		</family>
	</devices>
	
	<!-- conditions section (optional for all Software Packs)-->
	<conditions>
	
		<!-- Compiler Conditions -->
		
			<condition id="ARMCC">
				<require Tcompiler="ARMCC"/>
			</condition>
  		
    	<condition id="IAR">
     		<require Tcompiler="IAR"/>
   		</condition>
   		
   		<condition id="GCC">
      	<require Tcompiler="GCC"/>
    	</condition>
  	
  	    	
        	
		<condition id="Startup ARM">
			<description>Startup assembler file for ARMCC</description>
			<require condition = "ARMCC" />
		</condition>

		<condition id="Startup GCC">
			<description>Startup assembler file for GCC</description>
			<require condition="GCC"/>
		</condition>

		<condition id="Startup IAR">
			<description>Startup assembler file for IAR</description>
			<require condition="IAR"/>
		</condition>
		    	



		<!--  SH30F9 SA0 -->  
		  <condition id="SH30F9020">
				<require Dname="SH30F9020"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
	  </condition>

		  <condition id="SH30F9021">
				<require Dname="SH30F9021"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
	  </condition>

		  <condition id="SH30F9071">
				<require Dname="SH30F9071"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
	  </condition>

		  <condition id="SH30F9820">
				<require Dname="SH30F9820"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
	  </condition>

		  <condition id="SH30F9821">
				<require Dname="SH30F9821"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
	  </condition>

		  <condition id="SH30F9871">
				<require Dname="SH30F9871"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
	  </condition>

	    <condition id="SH30F9_SA0">
			<description>Sinowealth SH30F9_SA0 Series Device</description>	
	      <accept condition="SH30F9020"/>                  
	      <accept condition="SH30F9021"/>                  
	      <accept condition="SH30F9071"/>                  
	      <accept condition="SH30F9820"/>                  
	      <accept condition="SH30F9821"/>                  
	      <accept condition="SH30F9871"/>                  
	    </condition>

	    <condition id="SH30F9_SA0_LCD">
			<description>Sinowealth SH30F9_SA0 Series Device with LCD</description>	    
	      <accept condition="SH30F9020"/>          
	      <accept condition="SH30F9071"/>          
	      <accept condition="SH30F9820"/>          
	      <accept condition="SH30F9871"/>          
	    </condition>

	    <condition id="SH30F9_SA0_LED">
			<description>Sinowealth SH30F9_SA0 Series Device with LED</description>	    
	      <accept condition="SH30F9020"/>          
	      <accept condition="SH30F9071"/>          
	      <accept condition="SH30F9820"/>          
	      <accept condition="SH30F9871"/>          
	    </condition>

		<!--  SH32F9 SB0 -->  
		  <condition id="SH32F9001">
				<require Dname="SH32F9001"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
		  </condition>

		  <condition id="SH32F9002">
				<require Dname="SH32F9002"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
		  </condition>

		  <condition id="SH32F9801">
				<require Dname="SH32F9801"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
		  </condition>

		  <condition id="SH32F9061">
				<require Dname="SH32F9061"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
		  </condition>


		  <condition id="SH32F9062">
				<require Dname="SH32F9062"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
		  </condition>

		  <condition id="SH32F9861">
				<require Dname="SH32F9861"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
		  </condition>

	    <condition id="SH32F9_SB0">
			<description>Sinowealth SH32F9_SB0 Series Device</description>	
	      <accept condition="SH32F9001"/>
	      <accept condition="SH32F9002"/>                  
	      <accept condition="SH32F9801"/>                  
	      <accept condition="SH32F9061"/>  
	      <accept condition="SH32F9062"/>                                  
	      <accept condition="SH32F9861"/>  
	    </condition>

		  <condition id="SH32F9061_TouchKey">
				<require condition="SH32F9061"/>	
			  <require Cclass ="Sino_TouchKey" Cgroup="TouchKey" />
		  </condition>

		  <condition id="SH32F9062_TouchKey">
				<require condition="SH32F9062"/>	
			  <require Cclass ="Sino_TouchKey" Cgroup="TouchKey" />
		  </condition>

		  <condition id="SH32F9861_TouchKey">
				<require condition="SH32F9861"/>	
			  <require Cclass ="Sino_TouchKey" Cgroup="TouchKey" />
		  </condition>

	    <condition id="SH32F9_SB0_TouchKey">
			<description>Sinowealth SH32F9_SB0 Series Device with TouchKey</description>	
	      <accept condition="SH32F9061_TouchKey"/>                  
	      <accept condition="SH32F9062_TouchKey"/>                  
	      <accept condition="SH32F9861_TouchKey"/>                  
	    </condition>


		<!--  SH32F9 SC0 -->  
		  <condition id="SH32F9B00">
				<require Dname="SH32F9B00"/>	
	  	  <require Cclass="CMSIS" Cgroup="CORE"/>						
	      <accept condition="ARMCC"/>
	      <accept condition="GCC" />
	      <accept condition="IAR" />			
	  </condition>

