XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
	    <condition id="SH32F9_SC0">
			<description>Sinowealth SH32F9_SC0 Series Device</description>	
	      <accept condition="SH32F9B00"/>                  
	    </condition>

		  <condition id="SH32F9B00_TouchKey">
				<require condition="SH32F9B00"/>	
			  <require Cclass ="Sino_TouchKey" Cgroup="TouchKey" />
		  </condition>

	    <condition id="SH32F9_SC0_TouchKey">
			<description>Sinowealth SH32F9_SC0 Series Device with TouchKey</description>	
	      <accept condition="SH32F9B00_TouchKey"/>                  
	    </condition>

			<condition id="HA Stdlib TouchKey">
			  <description>Sinowealth SH3xF9xx Series Touchkey Driver </description>
			  <require Cclass="Sino32StdPeripherals" Cgroup="COMMON" />
			  <accept  condition="SH32F9_SB0_TouchKey" />            
			  <accept  condition="SH32F9_SC0_TouchKey" />            
			</condition>

	    <condition id="HA Stdlib TouchKey MDK">
				<require condition = "ARMCC" />	
	      <accept  condition="HA Stdlib TouchKey"/>                  
	    </condition>

	    <condition id="HA Stdlib TouchKey IAR">
				<require condition = "IAR" />
	      <accept  condition="HA Stdlib TouchKey"/>                  
	    </condition>


	    
<!--  MODULE CONDITION --> 
   
   <condition id="HA Stdlib COMMON">
      <description>Sinowealth SH3xF9xx Series COMMON Driver with CMSIS</description>
	  	<require Cclass="CMSIS" Cgroup="CORE"/>						
      <require Cclass ="Sino32StdPeripherals" Cgroup="IWDT" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>
   
   <condition id="HA Stdlib RCC">
      <description>Sinowealth SH3xF9xx Series RCC Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>
   
   <condition id="HA Stdlib GPIO">
      <description>Sinowealth SH3xF9xx Series GPIO Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>

   <condition id="HA Stdlib ADC">
      <description>Sinowealth SH3xF9xx Series ADC Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>   

   <condition id="HA Stdlib AMOC">
      <description>Sinowealth SH3xF9xx Series AMOC Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH32F9_SB0" /> 
      <accept condition="SH32F9_SC0" />                 
   </condition> 

   <condition id="HA Stdlib CRC">
      <description>Sinowealth SH3xF9xx Series CRC Driver</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>

   <condition id="HA Stdlib DMA">
      <description>Sinowealth SH3xF9xx Series DMA Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />
   </condition>

   <condition id="HA Stdlib EXTI">
      <description>Sinowealth SH3xF9xx Series EXTI Driver</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>

   <condition id="HA Stdlib FLASH">
      <description>Sinowealth SH3xF9xx Series FLASH Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>

   <condition id="HA Stdlib GPT">
     <description>Sinowealth SH3xF9xx Series GPT Driver with CMSIS</description>
     <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
     <accept condition="SH32F9_SC0" />      
   </condition>
   
   <condition id="HA Stdlib IWDT">
      <description>Sinowealth SH3xF9xx Series IWDT Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>

   <condition id="HA Stdlib LCD">
      <description>Sinowealth SH3xF9xx Series LCD Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
   </condition>

   <condition id="HA Stdlib LED">
      <description>Sinowealth SH3xF9xx Series LED Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
   </condition>

   <condition id="HA Stdlib NVIC">
      <description>Sinowealth SH3xF9xx Series NVIC Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="COMMON" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>

   <condition id="HA Stdlib PCA">
      <description>Sinowealth SH3xF9xx Series PCA Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
   </condition>

   <condition id="HA Stdlib PWM">
      <description>Sinowealth SH3xF9xx Series PWM Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
   </condition>

   <condition id="HA Stdlib RAMBIST">
      <description>Sinowealth SH3xF9xx Series RAMBIST Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />
   </condition>
   
   <condition id="HA Stdlib SPI">
      <description>Sinowealth SH3xF9xx Series SPI Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />
   </condition>

