XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
   <condition id="HA Stdlib SYSCFG">
      <description>Sinowealth SH3xF9xx Series SYSCFG Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>

   <condition id="HA Stdlib TIMER">
      <description>Sinowealth SH3xF9xx Series TIMER Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
  </condition>

   <condition id="HA Stdlib TWI">
      <description>Sinowealth SH3xF9xx Series TWI Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
    </condition>

   <condition id="HA Stdlib UART">
      <description>Sinowealth SH3xF9xx Series UART Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="GPIO" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>

   <condition id="HA Stdlib WWDT">
      <description>Sinowealth SH3xF9xx Series WWDT Driver with CMSIS</description>
      <require Cclass ="Sino32StdPeripherals" Cgroup="RCC" />
      <accept condition="SH30F9_SA0" />
      <accept condition="SH32F9_SB0" />            
      <accept condition="SH32F9_SC0" />      
   </condition>

	</conditions>

		
	<!-- component section (optional for all Software Packs)-->
	<components>

		<!-- Startup SH30F9020 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH30F9020">
			<description>System Startup for SH30F9020 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9020.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/startup_sh30f9020_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/startup_sh30f9020_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/startup_sh30f9020_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/sh30f9020_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/sh30f9020_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9020_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/system_sh30f9xx_sa0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/Include/system_sh30f9xx_sa0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>

		<!-- Startup SH30F9021 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH30F9021">
			<description>System Startup for SH30F9021 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9021.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/startup_sh30f9021_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/startup_sh30f9021_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/startup_sh30f9021_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/sh30f9021_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/sh30f9021_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9021_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/system_sh30f9xx_sa0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/Include/system_sh30f9xx_sa0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>

		<!-- Startup SH30F9071 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH30F9071">
			<description>System Startup for SH30F9071 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9071.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/startup_sh30f9071_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/startup_sh30f9071_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/startup_sh30f9071_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/sh30f9071_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/sh30f9071_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9071_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/system_sh30f9xx_sa0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/Include/system_sh30f9xx_sa0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>

		<!-- Startup SH30F9820 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH30F9820">
			<description>System Startup for SH30F9820 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9820.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/startup_sh30f9820_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/startup_sh30f9820_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/startup_sh30f9820_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
