XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/sh30f9820_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/sh30f9820_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9820_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/system_sh30f9xx_sa0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/Include/system_sh30f9xx_sa0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>

		<!-- Startup SH30F9821 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH30F9821">
			<description>System Startup for SH30F9821 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9821.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/startup_sh30f9821_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/startup_sh30f9821_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/startup_sh30f9821_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/sh30f9821_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/sh30f9821_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9821_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/system_sh30f9xx_sa0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/Include/system_sh30f9xx_sa0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>

		<!-- Startup SH30F9871 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH30F9871">
			<description>System Startup for SH30F9871 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH30F9xx/SH30F9xx_SA0/Include/sh30f9871.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/startup_sh30f9871_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/startup_sh30f9871_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/startup_sh30f9871_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/ARM/sh30f9871_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/GCC/sh30f9871_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/IAR/sh30f9871_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/Source/system_sh30f9xx_sa0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/Include/system_sh30f9xx_sa0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>


		<!-- Startup SH32F9001 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH32F9001">
			<description>System Startup for SH32F9001 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9001.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/startup_sh32f9001_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/startup_sh32f9001_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/startup_sh32f9001_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/sh32f9001_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/sh32f9001_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9001_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/system_sh32f9xx_sb0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/Include/system_sh32f9xx_sb0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>


		<!-- Startup SH32F9002 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH32F9002">
			<description>System Startup for SH32F9002 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9002.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/startup_sh32f9002_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/startup_sh32f9002_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/startup_sh32f9002_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
