XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/sh32f9002_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/sh32f9002_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9002_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/system_sh32f9xx_sb0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/Include/system_sh32f9xx_sb0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>


		<!-- Startup SH32F9801 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH32F9801">
			<description>System Startup for SH32F9801 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9801.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/startup_sh32f9801_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/startup_sh32f9801_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/startup_sh32f9801_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/sh32f9801_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/sh32f9801_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9801_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/system_sh32f9xx_sb0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/Include/system_sh32f9xx_sb0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>


		<!-- Startup SH32F9061 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH32F9061">
			<description>System Startup for SH32F9061 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9061.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/startup_sh32f9061_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/startup_sh32f9061_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/startup_sh32f9061_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/sh32f9061_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/sh32f9061_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9061_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/system_sh32f9xx_sb0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/Include/system_sh32f9xx_sb0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>


		<!-- Startup SH32F9062 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH32F9062">
			<description>System Startup for SH32F9062 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9062.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/startup_sh32f9062_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/startup_sh32f9062_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/startup_sh32f9062_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/sh32f9062_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/sh32f9062_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9062_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/system_sh32f9xx_sb0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/Include/system_sh32f9xx_sb0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>


		<!-- Startup SH32F9861 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH32F9861">
			<description>System Startup for SH32F9861 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH32F9xx/SH32F9xx_SB0/Include/sh32f9861.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/startup_sh32f9861_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/startup_sh32f9861_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/startup_sh32f9861_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
