XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/ARM/sh32f9861_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/GCC/sh32f9861_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/IAR/sh32f9861_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/Source/system_sh32f9xx_sb0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/Include/system_sh32f9xx_sb0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>


		<!-- Startup SH32F9B00 -->
		<component Cclass="Device" Cgroup="Startup"  Cversion="2.2.0"  condition="SH32F9B00">
			<description>System Startup for SH32F9B00 </description>
		
				<files>
        <!-- header file -->
		    <file category="header" name="Device/SH32F9xx/SH32F9xx_SC0/Include/sh32f9b00.h" />
		              
        <!-- startup files -->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0/Source/ARM/startup_sh32f9b00_keil.s"   attr="config" version="1.0.0" condition="Startup ARM"/>
				<!--file category="source" name="Device/SH32F9xx/SH32F9xx_SC0/Source/GCC/startup_sh32f9b00_gcc.S" attr="config" version="1.0.0" condition="Startup GCC"/-->
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0/Source/IAR/startup_sh32f9b00_iar.s" attr="config" version="1.0.0" condition="Startup IAR"/>
				
        <!-- linker files -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SC0/Source/ARM/sh32f9b00_keil.sct" attr="config" version="1.0.0" condition="Startup ARM"/>
        <!--file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SC0/Source/GCC/sh32f9b00_gcc.ld"   attr="config" version="1.0.0" condition="Startup GCC"/ -->
        <file category="linkerScript"  name="Device/SH32F9xx/SH32F9xx_SC0/Source/IAR/sh32f9b00_iar.icf"  attr="config" version="1.0.0" condition="Startup IAR"/>

        <!-- system files -->
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SC0/Source/system_sh32f9xx_sc0.c"     attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SC0/Include/system_sh32f9xx_sc0.h"    attr="config" version="1.1.0"/>

			</files>
		</component>
		
	
			<component Cclass="Sino32StdPeripherals" Cgroup="COMMON" Cversion="2.2.0" condition="HA Stdlib COMMON">
			<description>COMMON driver of Sino32 Stdlib</description>

			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_libcfg.h" attr="config" version="1.0.0" condition="SH30F9_SA0"/>
				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_libcfg.h" attr="config" version="1.0.0" condition="SH32F9_SB0"/>
				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_libcfg.h" attr="config" version="1.0.0" condition="SH32F9_SC0"/>
			</files>
		</component>

		
		<component Cclass="Sino32StdPeripherals" Cgroup="ADC" Cversion="2.2.0" condition="HA Stdlib ADC">
			<description>ADC driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_ADC
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_adc.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_adc.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_adc.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_adc.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_adc.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_adc.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>

			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="AMOC" Cversion="2.2.0" condition="HA Stdlib AMOC">
			<description>AMOC driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_AMOC
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_amoc.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_amoc.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_amoc.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_amoc.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>
		
		<component Cclass="Sino32StdPeripherals" Cgroup="CRC" Cversion="2.2.0" condition="HA Stdlib CRC">
			<description>Cyclic-redundancy-check (CRC) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_CRC
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_crc.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_crc.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_crc.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_crc.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_crc.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_crc.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="DMA" Cversion="2.2.0" condition="HA Stdlib DMA">
			<description>DMA driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_DMA
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_dma.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_dma.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_dma.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_dma.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_dma.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_dma.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="EXTI" Cversion="2.2.0" condition="HA Stdlib EXTI">
			<description>External-Interrupt (EXTI) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_EXTI
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_exti.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_exti.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_exti.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_exti.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

