XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_exti.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_exti.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>
		
		<component Cclass="Sino32StdPeripherals" Cgroup="FLASH" Cversion="2.2.0" condition="HA Stdlib FLASH">
			<description>Flash memory programming driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_FLASH
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_flash.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_flash.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_flash.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_flash.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_flash.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_flash.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="GPIO" Cversion="2.2.0" condition="HA Stdlib GPIO">
			<description>General-purpose-input-and-output (GPIO) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_GPIO
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_gpio.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_gpio.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_gpio.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_gpio.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_gpio.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_gpio.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="GPT" Cversion="2.2.0" condition="HA Stdlib GPT">
			<description>GPT driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_GPT
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_gpt.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_gpt.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="IWDT" Cversion="2.2.0" condition="HA Stdlib IWDT">
			<description>Independent-watchdog-timer (IWDT) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_IWDT
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_iwdt.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_iwdt.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_iwdt.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_iwdt.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_iwdt.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_iwdt.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="LCD" Cversion="2.2.0" condition="HA Stdlib LCD">
			<description>LCD driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_LCD
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_lcd.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_lcd.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_lcd.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_lcd.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="LED" Cversion="2.2.0" condition="HA Stdlib LED">
			<description>LED driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_LED
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_led.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_led.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_led.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_led.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="NVIC" Cversion="2.2.0" condition="HA Stdlib NVIC">
			<description>Additional Nested-vectored-interrupt-controller (NVIC) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_NVIC
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_nvic.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_nvic.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_nvic.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_nvic.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

