XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_nvic.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_nvic.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="PCA" Cversion="2.2.0" condition="HA Stdlib PCA">
			<description>PCA driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_PCA
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_pca.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_pca.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_pca.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_pca.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="PWM" Cversion="2.2.0" condition="HA Stdlib PWM">
			<description>PWM driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_PWM
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_pwm.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_pwm.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_pwm.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_pwm.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="RAMBIST" Cversion="2.2.0" condition="HA Stdlib RAMBIST">
			<description>RAMBIST driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_RAMBIST
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_rambist.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_rambist.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_rambist.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_rambist.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_rambist.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_rambist.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="RCC" Cversion="2.2.0" condition="HA Stdlib RCC">
			<description>Reset-and-clock-control (RCC) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_RCC
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_rcc.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_rcc.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_rcc.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_rcc.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_rcc.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_rcc.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="SPI" Cversion="2.2.0" condition="HA Stdlib SPI">
			<description>Serial Peripheral Interface (SPI) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_SPI
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_spi.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_spi.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_spi.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_spi.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_spi.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_spi.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="SYSCFG" Cversion="2.2.0" condition="HA Stdlib SYSCFG">
			<description>System configuration (SYSCFG) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_SYSCFG
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_syscfg.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_syscfg.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_syscfg.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_syscfg.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_syscfg.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_syscfg.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>		

		<component Cclass="Sino32StdPeripherals" Cgroup="TIMER" Cversion="2.2.0" condition="HA Stdlib TIMER">
			<description>General Timer driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_TIMER
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_timer.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_timer.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_timer.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_timer.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

