XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_timer.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_timer.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>		

		<component Cclass="Sino32StdPeripherals" Cgroup="TWI" Cversion="2.2.0" condition="HA Stdlib TWI">
			<description>Two-wire-serial-interface (TWI) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_TWI
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_twi.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_twi.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_twi.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_twi.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_twi.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_twi.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>

		<component Cclass="Sino32StdPeripherals" Cgroup="UART" Cversion="2.2.0" condition="HA Stdlib UART">
			<description>Universal-asynchronous-receiver-transmitter (UART) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_UART
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_uart.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_uart.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_uart.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_uart.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_uart.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_uart.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component>
		
		<component Cclass="Sino32StdPeripherals" Cgroup="WWDT" Cversion="2.2.0" condition="HA Stdlib WWDT">
			<description>Window-watchdog-timer (WWDT) driver of Sino32 Stdlib</description>
			<RTE_Components_h>
        	#define RTE_MODULE_WWDT
      </RTE_Components_h>
			<files>
				<file category="header" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/inc/sh30f9xx_sa0_wwdt.h"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>
				<file category="source" name="Device/SH30F9xx/SH30F9xx_SA0_StdPeriph_Driver/src/sh30f9xx_sa0_wwdt.c"   attr="config"  version="1.1.0"   condition="SH30F9_SA0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/inc/sh32f9xx_sb0_wwdt.h"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SB0_StdPeriph_Driver/src/sh32f9xx_sb0_wwdt.c"   attr="config"  version="1.1.0"   condition="SH32F9_SB0"/>

				<file category="header" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/inc/sh32f9xx_sc0_wwdt.h"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
				<file category="source" name="Device/SH32F9xx/SH32F9xx_SC0_StdPeriph_Driver/src/sh32f9xx_sc0_wwdt.c"   attr="config"  version="1.1.0"   condition="SH32F9_SC0"/>
			</files>
		</component> 

		<!-- END: Sino_HA Standard Peripherals Drivers -->

			
		<!-- END: Project Config  -->
			
		<!-- START: Project Template  -->	

		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH30F9020">
			<description>Project Template for SH30F9020 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH30F9xx_SA0/templates/SH30F9020/" condition="SH30F9020"/>				      
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9020/sh30f9020_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9020/sh30f9020_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9020/sh30f9xx_sa0_retarget.h"   attr="config" version="1.0.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9020/sh30f9xx_sa0_retarget.c"   attr="config" version="1.0.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH30F9021">
			<description>Project Template for SH30F9021 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH30F9xx_SA0/templates/SH30F9021/" condition="SH30F9021"/>				      
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9021/sh30f9021_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9021/sh30f9021_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9021/sh30f9xx_sa0_retarget.h"   attr="config" version="1.0.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9021/sh30f9xx_sa0_retarget.c"   attr="config" version="1.0.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH30F9071">
			<description>Project Template for SH30F9071 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH30F9xx_SA0/templates/SH30F9071/" condition="SH30F9071"/>				      
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9071/sh30f9071_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9071/sh30f9071_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9071/sh30f9xx_sa0_retarget.h"   attr="config" version="1.0.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9071/sh30f9xx_sa0_retarget.c"   attr="config" version="1.0.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH30F9820">
			<description>Project Template for SH30F9820 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH30F9xx_SA0/templates/SH30F9820/" condition="SH30F9820"/>				      
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9820/sh30f9820_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9820/sh30f9820_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9820/sh30f9xx_sa0_retarget.h"   attr="config" version="1.0.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9820/sh30f9xx_sa0_retarget.c"   attr="config" version="1.0.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH30F9821">
			<description>Project Template for SH30F9821 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH30F9xx_SA0/templates/SH30F9821/" condition="SH30F9821"/>				      
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9821/sh30f9821_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9821/sh30f9821_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9821/sh30f9xx_sa0_retarget.h"   attr="config" version="1.0.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9821/sh30f9xx_sa0_retarget.c"   attr="config" version="1.0.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH30F9871">
			<description>Project Template for SH30F9871 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH30F9xx_SA0/templates/SH30F9871/" condition="SH30F9871"/>				      
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9871/sh30f9871_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9871/sh30f9871_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9871/sh30f9xx_sa0_retarget.h"   attr="config" version="1.0.0"/>
        <file category="source"  name="Device/SH30F9xx/SH30F9xx_SA0/templates/SH30F9871/sh30f9xx_sa0_retarget.c"   attr="config" version="1.0.0"/>
     </files>
		</component>
	
		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH32F9001">
			<description>Project Template for SH32F9001 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9001/" condition="SH32F9001"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9001/sh32f9001_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9001/sh32f9001_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9001/sh32f9xx_sb0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9001/sh32f9xx_sb0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH32F9002">
			<description>Project Template for SH32F9002 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9002/" condition="SH32F9002"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9002/sh32f9002_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9002/sh32f9002_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9002/sh32f9xx_sb0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9002/sh32f9xx_sb0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>
		
		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH32F9801">
			<description>Project Template for SH32F9801 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9801/" condition="SH32F9801"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9801/sh32f9801_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9801/sh32f9801_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9801/sh32f9xx_sb0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9801/sh32f9xx_sb0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>
		
		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH32F9061">
			<description>Project Template for SH32F9061 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9061/" condition="SH32F9061"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9061/sh32f9061_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9061/sh32f9061_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9061/sh32f9xx_sb0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9061/sh32f9xx_sb0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH32F9062">
			<description>Project Template for SH32F9062 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9062/" condition="SH32F9062"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9062/sh32f9062_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9062/sh32f9062_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9062/sh32f9xx_sb0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9062/sh32f9xx_sb0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>
		
		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH32F9861">
			<description>Project Template for SH32F9861 </description>
			<files>
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9861/" condition="SH32F9861"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9861/sh32f9861_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9861/sh32f9861_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9861/sh32f9xx_sb0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9861/sh32f9xx_sb0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>

