XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Sinowealth.SH3xF9xx_DFP.pdsc
		<component Cclass="Project" Cgroup="Project Template With TouchKey" Cversion="1.1.0" condition="SH32F9061_TouchKey">
			<description>Project Template With TouchKey for SH32F9061 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9061/" condition="SH32F9061_TouchKey"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9061/sh32f9061_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/TouchKey_C/sh32f9061_main.c"                                         attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9061/sh32f9xx_sb0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9061/sh32f9xx_sb0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template With TouchKey" Cversion="1.1.0" condition="SH32F9062_TouchKey">
			<description>Project Template With TouchKey for SH32F9062 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9062/" condition="SH32F9062_TouchKey"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9062/sh32f9062_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/TouchKey_C/sh32f9062_main.c"                                         attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9062/sh32f9xx_sb0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9062/sh32f9xx_sb0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>
		
		<component Cclass="Project" Cgroup="Project Template With TouchKey" Cversion="1.1.0" condition="SH32F9861_TouchKey">
			<description>Project Template With TouchKey for SH32F9861 </description>
			<files>
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9861/" condition="SH32F9861_TouchKey"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9861/sh32f9861_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/TouchKey_C/sh32f9861_main.c"                                         attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9861/sh32f9xx_sb0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SB0/templates/SH32F9861/sh32f9xx_sb0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>
		
		<component Cclass="Project" Cgroup="Project Template" Cversion="1.1.0" condition="SH32F9B00">
			<description>Project Template for SH32F9B00 </description>
			<files>      
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SC0/templates/SH32F9B00/" condition="SH32F9B00"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SC0/templates/SH32F9B00/sh32f9b00_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SC0/templates/SH32F9B00/sh32f9b00_main.c"          attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SC0/templates/SH32F9B00/sh32f9xx_sc0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SC0/templates/SH32F9B00/sh32f9xx_sc0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>

		<component Cclass="Project" Cgroup="Project Template With TouchKey" Cversion="1.1.0" condition="SH32F9B00_TouchKey">
			<description>Project Template With TouchKey for SH32F9B00 </description>
			<files>
				<file category="include" name="Device/SH32F9xx/SH32F9xx_SC0/templates/SH32F9B00/" condition="SH32F9B00_TouchKey"/>				      
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SC0/templates/SH32F9B00/sh32f9b00_interrupt.c"     attr="config" version="1.1.0"/>
        <file category="source"  name="Device/TouchKey_C/sh32f9B00_main.c"                                         attr="config" version="1.1.0"/>
        <file category="header"  name="Device/SH32F9xx/SH32F9xx_SC0/templates/SH32F9B00/sh32f9xx_sc0_retarget.h"   attr="config" version="1.1.0"/>
        <file category="source"  name="Device/SH32F9xx/SH32F9xx_SC0/templates/SH32F9B00/sh32f9xx_sc0_retarget.c"   attr="config" version="1.1.0"/>
     </files>
		</component>

									
		<!-- END: Project Template -->				


		<!-- TouchKey -->
		<component Cclass="Sino_TouchKey" Cgroup="TouchKey"  Cversion="1.3.1"  condition="HA Stdlib TouchKey">
			<description>TouchKey driver for Sino32 Stdlib</description>
		
			<RTE_Components_h>
        	#define RTE_MODULE_TouchKey
      </RTE_Components_h>
			<files>

				<file category="include" name="Device/TouchKey_C/Sino_touchkey/Inc"  																																								condition="HA Stdlib TouchKey"/>
				<file category="library" name="Device/TouchKey_C/Sino_touchkey/Lib/SH3xF9xxx_TouchKey_C_V1.3.1.lib"                attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey MDK"/>
				<file category="library" name="Device/TouchKey_C/Sino_touchkey/Lib/SH3xF9xxx_TouchKey_C_V1.3.1.a"                  attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey IAR"/>
				<file category="source"  name="Device/TouchKey_C/Sino_touchkey/Lib/sino_tk_isr.c"                                  attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey"/>
				<file category="source"  name="Device/TouchKey_C/Sino_touchkey/Lib/sino_uart.c"                                    attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey"/>

				<file category="source"  name="Device/TouchKey_C/Sino_touchkey/Tk_sh32f9xx_sb0_bsp/tk_sh32f9xx_sb0_bsp.c"          attr="config"  version="1.1.0"   condition="SH32F9_SB0_TouchKey"/>
				<file category="header"  name="Device/TouchKey_C/Sino_touchkey/Tk_sh32f9xx_sb0_bsp/tk_sh32f9xx_sb0_bsp.h"          attr="config"  version="1.1.0"   condition="SH32F9_SB0_TouchKey"/>

				<file category="source"  name="Device/TouchKey_C/Sino_touchkey/Tk_sh32f9xx_sc0_bsp/tk_sh32f9xx_sc0_bsp.c"          attr="config"  version="1.1.0"   condition="SH32F9_SC0_TouchKey"/>
				<file category="header"  name="Device/TouchKey_C/Sino_touchkey/Tk_sh32f9xx_sc0_bsp/tk_sh32f9xx_sc0_bsp.h"          attr="config"  version="1.1.0"   condition="SH32F9_SC0_TouchKey"/>

				<file category="header"  name="Device/TouchKey_C/Sino_touchkey/Inc/sino_touchkey.h"          attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey"/>
				<file category="header"  name="Device/TouchKey_C/Sino_touchkey/Inc/sino_uart.h"              attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey"/>
				<file category="header"  name="Device/TouchKey_C/Sino_touchkey/Inc/tk_conf.h"                attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey"/>
				<file category="header"  name="Device/TouchKey_C/Sino_touchkey/Inc/tk_conf_add.h"            attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey"/>
				<file category="header"  name="Device/TouchKey_C/Sino_touchkey/Inc/tk_error_information.h"   attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey"/>
				<file category="header"  name="Device/TouchKey_C/Sino_touchkey/Inc/tk_include.h"             attr="config"  version="1.1.0"   condition="HA Stdlib TouchKey"/>

			</files>
		</component>

										
	</components>
		
        
</package>